/**
 * 用户名验证正则表达式 规则：
 *
 * - 只允许大小写英文字母、数字和下划线
 * - 长度限制：5-20个字符
 * - 不允许中文字符和特殊符号
 */
export const REG_USER_NAME = /^[a-zA-Z0-9_]{5,20}$/;

/**
 * 密码验证正则表达式 规则：
 *
 * - 长度限制：6-25个字符
 * - 必须包含大写字母（至少1个）
 * - 必须包含小写字母（至少1个）
 * - 必须包含数字（至少1个）
 * - 必须包含特殊符号（至少1个）：~!@#$%^&_-
 * - 只允许上述字符类型，不允许其他字符
 */
export const REG_PWD = /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[~!@#$%^&_-])[a-zA-Z\d~!@#$%^&_-]{6,25}$/;
/** Phone reg */
export const REG_PHONE =
  /^[1](([3][0-9])|([4][01456789])|([5][012356789])|([6][2567])|([7][0-8])|([8][0-9])|([9][012356789]))[0-9]{8}$/;

/** Email reg */
export const REG_EMAIL = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

/** Six digit code reg */
export const REG_CODE_SIX = /^\d{6}$/;

/** Four digit code reg */
export const REG_CODE_FOUR = /^\d{4}$/;

/** Url reg */
export const REG_URL =
  /(((^https?:(?:\/\/)?)(?:[-;:&=+$,\w]+@)?[A-Za-z0-9.-]+(?::\d+)?|(?:www.|[-;:&=+$,\w]+@)[A-Za-z0-9.-]+)((?:\/[+~%/.\w-_]*)?\??(?:[-+=&;%@.\w_]*)#?(?:[\w]*))?)$/;
